/***************************************/
// Переменные
/***************************************/

// let number = 5; //изменяемая переменная
// const leftBorderWidth = 1; //неизменяемая переменная

// number = 10;
// console.log(number);

// const obj = { //другой вариант записи
//     a: 50
// };

// obj.a = 10;
// console.log(obj);

// var russian = 'Ivan'; // устаревшая переменная


/**************************************************************/
// Типы данных в JS
/**************************************************************/
// ПРОСТЫЕ ТИПЫ

// //число
// let number = 4.6; // числа пишутся без кавычек

// console.log(-4/0);
// console.log('string' * 9);// NAN - not a number

// //строка
// const person = "Alex";

// // булевые значения
// const bool = true;
// const bool2 = false;

// // null
// console.log(something);

// // undefined
// let und;
// console.log(und);


// // ОБЪЕКТЫ

// const obj = {
//     name: "John",
//     age: 25,
//     isMarried: false
// };

// // console.log(obj.name); //правильнее обращаться к свойству объекта через .
// // console.log(obj['name']); //неправильно, но работает

// // Массив
// let arr = ['plum.png', 'orange.jpg', 'apple.bmp'];
// console.log(arr[1]);



/**************************************************************/
// Работа с пользователем
/**************************************************************/

// alert('hello!');

// const result = confirm("are you here?"); 
// console.log(result);

// const answer = +prompt("Вам есть 18?", "18");
// console.log(answer + 5);

// const answers = [];

// answers[0] = prompt('Как вас зовут?', '');
// answers[1] = prompt('Какая у вас фамилия?', '');
// answers[2] = prompt('Сколько вам лет?', '');

// console.log(typeof(answers));


/**************************************************************/
// Интерполяция - вставление переменной прямо внутри строки с ``
/**************************************************************/

// const category = 'toys';

// console.log(`https://someurl.com/${category}/5`);

// const user = "Ivan";

// alert(`Привет, ${user}`);


/**************************************************************/
// Операторы в JS
/**************************************************************/
// Конкатенация 

// console.log('arr' + " - object");
// console.log(4 + +"5");

// let incr = 10,
//     decr = 10;

// постфиксная запись
// incr++; //увеличение значения на 1
// decr--; //уменьшение значения на 1

// префиксная запись
// ++incr; //увеличение значения на 1
// --decr; //уменьшение значения на 1

// console.log(++incr);
// console.log(--decr);

// console.log(5%2); // % возвращает остаток от деления чисел

// console.log(2*4 === 8); // == равно, === строгое равно

// console.log(2 + 2 * 2 !== '6');

// && оператор И
// || оператор ИЛИ
// const isChecked = false,
//       isClose = false;

// console.log(isChecked || !isClose);

// ! оператор отрицания (меняет значение на противоположное)


